app/views/devise/registrations/new.html.erb

    <%= f.input :email, required: true, autofocus: true %>
    <%= f.input :cliente_id, required: true, :collection => Cliente.all, :label_method => :nombre, :value_method => :id%>
---
SELECT `clientes`.* FROM `clientes`