app/controllers/clientes_controller.rb

SELECT `clientes`.* FROM `clientes`
---
  def index
    @clientes = Cliente.all

INSERT INTO `clientes` (`created_at`, `direccion`, `email`, `nombre`, `nombre_contacto`, `razon_social`, `region_id`, `rut`, `telefono`, `updated_at`) VALUES ('2014-05-21 23:48:01', 'asasd 234', 'cvasquez@zaetachile.cl', 'asasd', 'cristian vasquez', 'asdas', 7, '34243534-6', '234465', '2014-05-21 23:48:01')
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 1 LIMIT 1
---
    def set_cliente
      @cliente = Cliente.find(params[:id])