app/controllers/medias_controller.rb

  def index
    @medias = Media.all
---
SELECT `medias`.* FROM `medias`

  def destroy
    @media.destroy
---
DELETE FROM `medias` WHERE `medias`.`id` = 1

    def set_media
      @media = Media.find(params[:id])
---
SELECT `medias`.* FROM `medias` WHERE `medias`.`id` = 1 LIMIT 1