app/controllers/servicios_controller.rb

SELECT `servicios`.* FROM `servicios`
---
  def index
    @servicios = Servicio.all

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`rol_id` = 3
---
  def new
    @servicio = Servicio.new
    @usuarios = Usuario.where(rol_id: '3')

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`rol_id` = 3
---
  def edit
    @usuarios = Usuario.where(rol_id: '3')

INSERT INTO `servicios` (`created_at`, `precio`, `resumen`, `titulo`, `updated_at`, `usuario_worket_id`) VALUES ('2014-05-27 03:11:54', 10000, 'magordo de la casa', 'mago', '2014-05-27 03:11:54', 1)
---
  def create
    @servicio = Servicio.new(servicio_params)

    respond_to do |format|
      if @servicio.save

DELETE FROM `servicios` WHERE `servicios`.`id` = 1
---
  def destroy
    @servicio.destroy

SELECT `servicios`.* FROM `servicios` WHERE `servicios`.`id` = 2 LIMIT 1
---
    def set_servicio
      @servicio = Servicio.find(params[:id])