app/controllers/usuarios_controller.rb

SELECT `clientes`.* FROM `clientes`
---
  def new
    @usuario = Usuario.new
    @roles = TipoRol.all
    @clientes = Cliente.all

INSERT INTO `usuarios` (`apellido1`, `apellido2`, `created_at`, `email`, `encrypted_password`, `nombre1`, `nombre2`, `rol_id`, `telefono2`, `updated_at`) VALUES ('Vasquez', 'Parga', '2014-05-27 02:49:21', 'cvasquez@zaetachile.cl', '$2a$10$mRI6KeQZpSmCpVNcLSAsNOYWbr2mxW3cUlDv43D2GyW2dT0UY0qZi', 'Cristian ', 'Alejandro', 3, '72101837', '2014-05-27 02:49:21')
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 0 LIMIT 1
---
    def set_usuario
      @usuario = Usuario.find(params[:id])